# Домашнее задание к работе 2
## Условие задачи:

## Алгоритм и блок схема
### Алгоритм решения 

1.Начало:
2.Объявить константы :

V - объем молока в день
km = 31 - количество дней в марте
ka = 30 - количество дней в апреле

3.Задать исходные данные :
x - цена молока в марте
а - увеличение цены в апреле

4. Объем молока за март :
Vm = V * km

5.Вычислить стоимость молока за март :
pm = x * Vm

6.Найти разность цен с апрелем :
r = x + a

7.Вычислить цену молока в апреле :
ma = x + r = 2 * x + a

8.Вычислить объем молока за апрель :
Va = V * ka

9.Вычислить стоимость молока за апрель :
pa = Va * ma

10.Вычислить общую сумму к оплате :
sum = pa + pm

11.Вывести результаты расчетов с подстановкой значений.
12.Конец

## Блок схема

###РАСЧЕТ ПЛАТЫ ПРОДАВЦА В КОНЦЕ АПРЕЛЯ
## УСЛОВИЕ:
Цена молока в марте X = 60 руб 
Увеличение цены с 1 апреля а=15 руб 
Объём ежедневной доставки V=4 л
Количество дней в апреле N = 30 дней

Общая формула для любых значений
S = N * Vдень * (x + a)
Подставляя N = 30 и Vдень = 4:
S = 120 * (x + a)

## РАСЧЕТЫ
Новая цена молока в апреле:
Хапр = x + a = 60 + 15 = 75 руб / л 

Общее количество молока, доставленного за апрель
Так как объём доставки остался прежним(4 л в день), а в апреле 30 дней:

Vобщ= Vдень * N = 4 * 30 = 120 л
Итоговая сумма к оплате в конце апреля:
S = Vобщ * Xапр = 120 * 75 = 9000 руб
